In [32]:
import pandas as pd
import numpy as np

In [5]:
#Creating Series of data
ser_7=pd.Series(range(5),index=['a','b','c','d','e'])
ser_7

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [6]:
#creating an array
arr_7=np.random.randint(10,50,size=(2,3))
arr_7

array([[40, 20, 23],
       [18, 22, 20]])

In [7]:
#creating an dataframe

df_1=pd.DataFrame(arr_7,['B','C'],['C','D','E'])
df_1

    C   D   E
B  40  20  23
C  18  22  20

In [8]:
#creating for loop to iterate to a list
for col in ser_7:
    print(col)

0
1
2
3
4

In [9]:
# creating for loop to iterate from list.

for label,ser  in df_1.items():
    print(label)
    print(ser)

C
B    40
C    18
Name: C, dtype: int32
D
B    20
C    22
Name: D, dtype: int32
E
B    23
C    20
Name: E, dtype: int32

In [10]:
#creating loop.
for index,row in df_1.iterrows():
    print(f'{index}\n{row}')

B
C    40
D    20
E    23
Name: B, dtype: int32
C
C    18
D    22
E    20
Name: C, dtype: int32

In [11]:
# iterate over tuples

for row in df_1.itertuples():
    print(row)

Pandas(Index='B', C=40, D=20, E=23)
Pandas(Index='C', C=18, D=22, E=20)

In [12]:
# sorting
df_1

    C   D   E
B  40  20  23
C  18  22  20

In [13]:
#sorting
df_1.sort_index(ascending=False)

    C   D   E
C  18  22  20
B  40  20  23

In [26]:
import sys
#Creating a function which accept dataframe and return the requisite result.
def get_profit_total(df):
    prof_ser=df['Profit']
    print(f'Total Profit :{prof_ser.sum()}')

get_profit_total(df_cs)

Total Profit :5459.010000000001

In [25]:
df_cs=pd.read_csv('https://raw.githubusercontent.com/derekbanas/pandas-tutorial/master/ComputerSales.csv')

In [ ]:
df_cs.head(5)

In [ ]:
get_profit_total(df_cs)

In [ ]:
#creating function to split name into first Name and Last Name

def split_name(df):
    def get_names(fill_name):
        f_name,l_name=fill_name.split()
        return pd.Series((f_name,l_name),index=['First Name','Last Name'])
    names=df['Contact'].apply(get_names)
    df[names.columns]=names
    return df

In [ ]:
split_name(df_cs).head(5)

In [ ]:
#creating a function to categorizing in age group

def create_age_groups(df):
    bins=[0,30,50,sys.maxsize]
    labels=['<30','30-50','>50']
    age_group=pd.cut(df['Age'], bins=bins,labels=labels)
    df['Age Group']=age_group
    return df

In [ ]:
#executing the function 
create_age_groups(df_cs).head(5)

In [ ]:
#implementing function to a dataframe with the pipe method

df_cs.pipe(split_name).pipe(create_age_groups).head(5)

In [ ]:
ser_6=pd.Series(range(5),index=['a','b','c','d','d'])

In [ ]:
ser_6

In [ ]:
ser_1=ser_6[:4]
ser_1

In [ ]:
ser_2=ser_6[1:]
ser_2

In [ ]:
ser_1.align(ser_2)

In [17]:
# creating multi index data

days=['Day 1','Day 1','Day 1','Day 2','Day 2','Day 2']
meals=[1,2,3,1,2,3]
hier_index=list(zip(days,meals))
hier_index=pd.MultiIndex.from_tuples(hier_index)
arr_5=np.random.randint(500,700,size=(6,2))

df_9=pd.DataFrame(arr_5,hier_index,['M','F'])
print(df_9)

           M    F
Day 1 1  579  567
      2  635  643
      3  605  593
Day 2 1  514  551
      2  523  588
      3  683  634

In [18]:
df_9.loc['Day 1'].loc[1]

M    579
F    567
Name: 1, dtype: int32

In [19]:
df_9.loc['Day 2'].loc[2]['F']

588

In [22]:
df_9.index.names=['Day','Meal']
df_9

              M    F
Day   Meal
Day 1 1     579  567
      2     635  643
      3     605  593
Day 2 1     514  551
      2     523  588
      3     683  634

In [23]:
df_9.xs(1,level='Meal')

         M    F
Day
Day 1  579  567
Day 2  514  551

In [27]:
# creating a dictionry
dict_6={'A':['Day 1','Day 1','Day 1','Day 2','Day 2','Day 2'],
        'B':[1,2,3,1,2,3],
         'C':['M','F','M','F','M','F'],
           'D':[1,2,3,4,5,6]}
dict_6

{'A': ['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2'],
 'B': [1, 2, 3, 1, 2, 3],
 'C': ['M', 'F', 'M', 'F', 'M', 'F'],
 'D': [1, 2, 3, 4, 5, 6]}

In [29]:
df_14=pd.DataFrame(dict_6)
df_14

       A  B  C  D
0  Day 1  1  M  1
1  Day 1  2  F  2
2  Day 1  3  M  3
3  Day 2  1  F  4
4  Day 2  2  M  5
5  Day 2  3  F  6

In [30]:
df_14.pivot_table(values='D',index=['A','B'],columns=['C'])

C          F    M
A     B
Day 1 1  NaN  1.0
      2  2.0  NaN
      3  NaN  3.0
Day 2 1  4.0  NaN
      2  NaN  5.0
      3  6.0  NaN

In [34]:
#creating a dictionary
dic_4={'A':[1,2,np.nan],
      'B':[4,np.nan,np.nan],
      'C':[7,8,9]}

{'A': [1, 2, nan], 'B': [4, nan, nan], 'C': [7, 8, 9]}

In [35]:
#creating a dataframe
df_13=pd.DataFrame(dic_4)

In [40]:
df_13

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [37]:
df_13.dropna()

     A    B  C
0  1.0  4.0  7

In [38]:
#droping column with na value
df_13.dropna(axis=1)

   C
0  7
1  8
2  9

In [39]:
#changing value of na to o
df_13.fillna(value=0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  8
2  0.0  0.0  9

In [41]:
# filling mean values to dataset

df_13.fillna(value=df_13['A'].mean())

     A    B  C
0  1.0  4.0  7
1  2.0  1.5  8
2  1.5  1.5  9

In [42]:
#forward fill
df_13.fillna(method='ffill')

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  8
2  2.0  4.0  9

In [43]:
#backward fill
df_13.fillna(method='bfill')

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9